---
kind: type
id: T:Autodesk.Revit.DB.ReferenceArray
source: html/bc9192b5-6666-a8de-0128-87dae479fd6a.htm
---
# Autodesk.Revit.DB.ReferenceArray

An array that contains reference objects.

## Syntax (C#)
```csharp
public class ReferenceArray : APIObject,
	IEnumerable
```